app/views/auctions/show.html.erb


<% @auction.bids.each do |b| %>
---
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1  [["auction_id", 9]]