app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions"
---
  def index
    @auction = Auction.new
    @auctions = Auction.all

INSERT INTO "auctions" ("title", "details", "price", "date", "current_bid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @auction = Auction.new auction_params
    @auction.current_bid = 0
    if @auction.save

SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1  [["auction_id", 9]]
---
  def show
    @bid = @auction.bids.new
    @bids = Bid.all

UPDATE "auctions" SET "details" = $1, "updated_at" = $2 WHERE "auctions"."id" = $3  [["details", "These are the details for the first auction."], ["updated_at", "2015-02-27 21:28:49.216703"], ["id", 1]]
---
  def update
    if @auction.update auction_params

DELETE FROM "auctions" WHERE "auctions"."id" = $1  [["id", 3]]
---
  def destroy
    @auction.destroy

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", nil]]
---
  def find_auction
    @auction = Auction.find params[:id]