app/controllers/bids_controller.rb

  def create
    @auction = Auction.find params[:auction_id]
    @bid = @auction.bids.new bid_params
    if @bid.bid_price > @auction.current_bid
      if @bid.save
        redirect_to @auction
        @auction.current_bid = @bid.bid_price
        @auction.save
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT 1  [["id", 5]]
INSERT INTO "bids" ("bid_price", "auction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["bid_price", 1000], ["auction_id", 5], ["created_at", "2015-02-27 22:34:55.346598"], ["updated_at", "2015-02-27 22:34:55.346598"]]
UPDATE "auctions" SET "current_bid" = $1, "updated_at" = $2 WHERE "auctions"."id" = $3  [["current_bid", 124], ["updated_at", "2015-02-28 00:41:35.259070"], ["id", 5]]